# #დავალება:

# 1. შექმენით ფუნქცია სახელად manual_reverse, რომელიც მიიღებს დალაგებულ კოლექციას. თქვენი დავალებაა,
# რომ შეაბრუნოთ ეს კოლექცია და დააბრუნოთ ამ სახით.

# 1. [1, 2, 3, 4, 5] -> [5, 4, 3, 2, 1]


# def manual_reverse(numbers):
#     numbers.reverse()
#     return numbers


# print(manual_reverse([1,2,3,4,5]))


################################################################################################################################################################################################################

# 2. შექმენით ფუნქცია სახელად manual_replace, რომელიც მიიღებს სია, ჩასანაცლებელ ელემენტს და იმ ელემენტს,
# რომლითაც უნდა ჩანაცვლდეს. თქვენი დავალებაა, რომ დააბრუნოთ ახალი კოლექცია, სადაც გექნებათ ჩანაცვლებული 
# ყველა ელემენტი მესამე პარამეტრით.

# 2. [10, 11, 10, 11], 10, 20 -> [20, 11, 20, 11]

# def manual_replace(number_list, replace_char, replaced_char):
#     new_list = []

#     for i in number_list:  
#         if i == replace_char:
#             i = replaced_char
#             new_list.append(i)
#         else:
#             new_list.append(i)
            
#     return new_list



# print(manual_replace([10, 11, 10, 11], 10, 20))



################################################################################################################################################################################################################

# 3. შექმენით ფუნქცია სახელად manual_count, რომელიც მიიღებს დალაგებულ კოლექციას და დასათვლელ მნიშვნელობას. 
# თქვენი დავალებაა, რომ დააბრუნოთ თუ რამდენჯერ გექნებათ დასათვლელი მნიშვნელობა კოლექციაში.
# ამ დავალებების შესასრულებლად არ გამოიყენოთ built-in ანუ ჩაშენებული ფუნქციები, ლოგიკა უნდა დაწეროთ თქვენით

# 3. [12, 13, 14, 12, 14, 100], 12 -> 2

# def manual_count(numbers, Countable_number):
#     count = 0

#     for i in numbers:
#         if i == Countable_number:
#             count += 1
#     return Countable_number,"number is repeated in the list",count, "times"


# print(manual_count([12, 13, 14, 12, 14, 100], 12))