
#########################################################################################################################################################


"""1) დაწერეთ პროგრამა, რომელიც ეკითხება მომხმარებლის ასაკს და შემდეგ დაბეჭდავს შეტყობინებას ასაკის მიხედვით: using(if-elif-else)
If the age is less than 18, print "You are a minor."
If the age is between 18 and 65, print "You are an adult."
If the age is 65 or older, print "You are a senior citizen." """


"""HOMEWORK TASK N1"""


# # ვადეკლარირებთ int ტიპის ცვლადს სახელად age რომელშიც მომხმარებელს შეეძლება შემოიტანოს მისი ასაკი
# age = int(input("enter youre age: "))

# # if ფუნქციის დახმარებით ვპრინტავთ შეტყობინებას თუ მომხმარებელი ასაკი 18-ზე დაბალია ტერმინალმა დაუბრუნოს რომ ის არასრულწლოვანია
# # ასევე თუ მომხმარებელის ასაკი 18-იდან 65-ს შეადგენს ტერმინალმა დაუბრუნოს რო ის სრულწლოვანია
# # სხვა შემთხვევაში ტერმინალი მას დაუბრუნებს რო ის ხანდაზმულია
# if age < 18:
#     print("You are a minor.")
# elif age >= 18 and age <= 65:
#     print("You are an adult.")
# else:
#     print("You are a senior citizen.")


#########################################################################################################################################################


"""2) შექმენით პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს რიცხვი და შემდეგ დაბეჭდოს რიცხვი ლუწია თუ კენტი.
   გამოიყენეთ ფორ ციკლი, რომ სთხოვოთ მომხმარებელს 5 რიცხვი და შეამოწმეთ ხუთივე რიცხვი."""

"""HOMEWORK TASK N2"""


# # ვიყენებთ for loops რადგან მომხმარებელს შემოვატანინოთ რაიმე რიცხვი 5-ის დიაპაზონში
# for i in range(5):
# # ვადეკარირებთ int ტიპის ცვლასდს სადაც მომხმარებელს აქვს შესაძლებლობა შემოიტანოს რაიმე რიცხვი
#     num = int(input("Please enter number: "))
# # თუ მომხმარებლის მიერ შემოტანილი რიცხვი იყოფა 2-ზე უნაშთოთ ტერმინალში დაიპრინტოს რომ ეს რიცხვი კენტია 
#     if num % 2 == 0:
#         print("This number is even")
# # სხვა შემთხვევაში დაიპრინტოს რომ ეს რიცხვი კენტია
#     else:
#         print("This number is odd")



#########################################################################################################################################################
    

    
"""3) დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს ქულები ასოებით (A, B, C, D ან F) 
    და შემდეგ დაბეჭდოს შეტყობინება ასოების მიხედვით: using(if-elif-else)
If the grade is A, print "Excellent!"
If the grade is B, print "Good job!"
If the grade is C, print "You passed."
If the grade is D, print "You can do better."
If the grade is F, print "You failed." """

"""HOMEWORK TASK N3"""


# print("List of results")

# print("A = Excellent!")
# print("B = Good job! ")
# print("C = You passed.")
# print("D = You can do better.")
# print("F = You failed.")



# # ვადეკლარირებთ str ტიპის ცვლადს სადაც მომხმარებელს შეუძლია შემოიტანოს მისი ქულების რაოდენობა 
# user_score = input("enter youre result: ")

# # თუ მომხმარებლის მიერ შემოტანილი str ინფორმაცია დაემთხვევა for loop-ში ჩაწერილ ინფორმაციას დაიბეჭდოს შესაფერისი ინფორმაცია
# if user_score == "a" or "A":
#     print("Excellent!")
# elif user_score == "b"or "B":
#     print("Good job!")
# elif user_score == "c" or "C":
#     print("You passed.")
# elif user_score == "d" or "D":
#     print("You can do better.")
# elif user_score == "f" or "F":
#     print("You failed.")
# else:
#     print("It's a mistake, try again")




#########################################################################################################################################################

"""4) დაწერეთ პროგრამა, რომელიც ბეჭდავს რიცხვებს 1-დან 10-მდე while ციკლის გამოყენებით"""


"""HOMEWORK TASK N4"""


# ვადეკლარირებთ int ტიპის ცვლადს რომელსაც ვანიჭებთ მნიშვნელოვბას 0
# x = 0

# სანამ x ანუ 0 < ან = 10-ის დაიბეჭდოს x მნიშვნელობა და ყოხელ ინტერაციაზე x დაემატოს 1
# while x <= 10:
#     print(x)
#     x += 1



# for x in range(10 + 1):
#     print(x)



#########################################################################################################################################################

"""5) შექმენით პროგრამა, რომელიც სთხოვს მომხმარებელს გამოიცნოს რიცხვი 1-დან 10-მდე.
 გამოიყენეთ while loop, რათა გააგრძელოთ კითხვა, სანამ მომხმარებელი სწორად არ გამოიცნობს"""

"""HOMEWORK TASK N5"""


# # ვადეკლარირირებთ int ტიპის ცვლადს რომელშიც მომხმარებელს შეუძლია შემოიტანოს რიცხვები
# num = int(input("enter first numbr for (1-10): "))

# # სანამ მომხმარებლის მიერ შემოტანილი რიცხვი არ იქნება 6-ის ტოლი იქამდე გამეორდეს ციკლი
# while num != 6:
#     num = int(input("PLease enter number again: "))

# # საბოლოოდ ვპრინტავთ რომ მომხმარებელმა გამოიცნო რიცხვი
# print("You guessed the number")

    




#########################################################################################################################################################


"""6) დაწერეთ პროგრამა, რომელიც დაბეჭდავს მოცემული რიცხვის (მაგ 5) პირველ 10 ჯერადს for loop-ის გამოყენებით."""


"""HOMEWORK TASK N6"""


# # ვატყობინებთ მომხმარებელს თუ რისი გაკეთება შეუძლია ამ საიტით მას
# print("This program will print the multiples of the number you enter")

# # ვადეკლარირებთ int ტიპის ცვლადს სადაც მომხამრებელს შეუძლია შემოიტანოს რიცხვები
# num = int(input("enter first number: "))


# # for i in range(1, 10 + 1):
# #     sum = num * i
# #     print(sum)






#########################################################################################################################################################


"""7) შექმენით პროგრამა, რომელიც ბეჭდავს უკუთვლას 10-დან 1-მდე for loop-ის გამოყენებით."""


"""HOMEWORK TASK N7"""



"""for loop"""

# # ვადეკლარირებთ int ტიპის ცვლადს და ვანიჭებთ მნიშვნელობას 10
# i = 10

# for x in range(10):
#     print(i)
#     i = i - 1


""""While loop"""

# # ვადეკლარირებთ int ტიპის ცვლადს და ვანიჭებთ მნიშვნელობას 10
# i = 10

# # სანამ i ანუ 10  მეტია  0-ზე დაიბეჭდოს i მნიშვნელობა და ხოველი დაბეჭდვის შემდეგ
# # i მნიშვნლობას შეეცნალოს მნიშვნელობა და გამოაკლდეს 1,  სანამ i მნიშვნელობა 1 არ გაუტოლდება
# while i > 0:
#     print(i)
#     i = i - 1


